Reports/РеестрДокументовЗачислениеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>РеестрДокументовЗачислениеПроживающих</Name>
			<Comment>Реестр документов “Зачисление Проживающих”</Comment>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ЗачислениеПроживающего.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗачислениеПроживающего</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол человека</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КурсОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/РеестрДокументовЗачислениеПроживающих/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Процедура Отчет()
	//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тил выходных данных
	Табдок.Очистить(); // очищаем на случай повторной формировки
	Табдок.ТолькоПросмотр = Истина; //даем право только на просмотр

	//2. Получаем созданный ранее макет с помощью вспомогательной процедуры:
	Макет = ПолучитьМакетНаСервере("Макет");

	//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	Табдок.Вывести(ОбластьЗаголовок);

	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);

	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанные");  
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
    "ВЫБРАТЬ
    |	ЗачислениеПроживающего.Ссылка КАК Ссылка,
    |	ЗачислениеПроживающего.Дата КАК Дата,
    |	ЗачислениеПроживающего.Номер КАК Номер,
    |	ЗачислениеПроживающего.Пол КАК Пол,
    |	ЗачислениеПроживающего.ДатаРождения КАК ДатаРождения,
    |	ЗачислениеПроживающего.КурсОбучения КАК КурсОбучения,
    |	ЗачислениеПроживающего.Наименование КАК Наименование
    |ИЗ
    |	Документ.ЗачислениеПроживающего КАК ЗачислениеПроживающего
    |
    |УПОРЯДОЧИТЬ ПО
    |	Дата,
    |	Ссылка";
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		ОбластьДанные.Параметры.Дата = ВыборкаДанных.Дата;
		ОбластьДанные.Параметры.Номер = ВыборкаДанных.Номер;
		ОбластьДанные.Параметры.Студент = ВыборкаДанных.Наименование;
		ОбластьДанные.Параметры.ДатаРождения = ВыборкаДанных.ДатаРождения;
		ОбластьДанные.Параметры.Пол = ВыборкаДанных.Пол;
		ОбластьДанные.Параметры.КурсОбучения = ВыборкаДанных.КурсОбучения;
		Табдок.Вывести(ОбластьДанные);
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции
